# 2) 판다스 데이터프레임 생성하고 데이터 가져오기

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(  #dIct 형태로 dataframe 생성
{"a" : [4,5,6],
"b" : [7,8,9],
"c" : [10,11,12]}, index = [1,2,3])

In [3]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [4]:
df["a"] #특정 column 보기

1    4
2    5
3    6
Name: a, dtype: int64

In [5]:
df.a

1    4
2    5
3    6
Name: a, dtype: int64

In [6]:
df.loc[3,"a"]

6

In [8]:
df.loc[[1,2], ["a","b"]] #여러개의 행과 열을 indexing

   a  b
1  4  7
2  5  8

In [10]:
df = pd.DataFrame(
    [[4,7,10],
    [5,8,11],
    [6,9,12]],
    index = [1,2,3],
    columns = ['a','b','c'])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [60]:
import numpy as np
df = pd.DataFrame(  #dIct 형태로 dataframe 생성
    {"a" : [4,5,6,6,np.nan],
    "b" : [7,8,np.nan,9,9],
    "c" : [10,11,12,np.nan,12]}, 
    index = pd.MultiIndex.from_tuples(  #tuple로 지정
    [('d',1),('d',2),('e',2),('e',3),('e',4)],
    names = ['n','v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

# 3) 판다스 데이터프레임 비교연산자로 색인하기, drop_duplicates()

In [38]:
df[df.a < 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [39]:
df[df.b > 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12
  3  6  9  12

In [40]:
df.b > 7

n  v
d  1    False
   2     True
e  2     True
   3     True
Name: b, dtype: bool

In [41]:
df[df['c'] > 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [42]:
df[df['c'] >= 7]  #전체 데이터에서 특정 row만 추출할 수 있다.

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [45]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [48]:
#df.drop_duplicates(inplace = True) #inplace= True는 권장하지 않는다. 값이 남아있지 않게 한다
df = df.drop_duplicates(keep ='last') #(keep = "first")도 해볼 것
df #e2가 아니라 e3가 남아있는 것을 볼 수 있다.

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

In [46]:
df.drop_duplicates?

# 4) Logic in Python (and pandas) - and, or, not, xor, any, all 연산 이해하기

In [49]:
df.head()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

In [50]:
df["a"] != 7

n  v
d  1    True
   2    True
e  3    True
Name: a, dtype: bool

In [51]:
df["b"] != 7

n  v
d  1    False
   2     True
e  3     True
Name: b, dtype: bool

In [53]:
df[df["b"] != 7]

     a  b   c
n v
d 2  5  8  11
e 3  6  9  12

In [57]:
#df.column.isin()  error가 난다. 특정 column을 지정해줘야 한다.
#df.a.isin(5) error가 난다. isin은 ?로 보면 리스트를 담아야 한다.
df.a.isin([5])

n  v
d  1    False
   2     True
e  3    False
Name: a, dtype: bool

In [58]:
df['a'].isin([5])

n  v
d  1    False
   2     True
e  3    False
Name: a, dtype: bool

In [61]:
pd.isnull(df)  #null값은 true로 되는 것을 볼 수 있다.

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [62]:
df['a'].isnull() #df에 isnull이 있는지

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [63]:
df['a'].isnull().sum() #null값이 몇 개 있는지

1

In [64]:
pd.notnull(df) #not null인 값에는 True, null인 값에 False

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  4  False   True   True

In [65]:
df.notnull() # 다른 방법

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  4  False   True   True

In [66]:
df.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [67]:
df.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

# &,|,~,^,df.any(),df.all()
# Logical and, or, not, xor, any, all

In [68]:
df.all()

a    True
b    True
c    True
dtype: bool

In [69]:
df.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

In [71]:
~df.a.notnull()  #~은 not

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [72]:
1 and 2

2

In [73]:
True and False

False

In [74]:
False and False

False

In [75]:
df[df.b == 7]

       a    b     c
n v
d 1  4.0  7.0  10.0

In [76]:
df[df.b == 7] and df[df.a == 5] #ambiguous 하다.

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [77]:
df[df.b == 7] & df[df.a == 5]

      a   b   c
n v
d 1 NaN NaN NaN
  2 NaN NaN NaN

# 5) head, tail로 데이터 미리보기 df.sample(frac=0.5), df.sample(n=10), df.nlargest, df.nsmallest

In [78]:
df = pd.DataFrame(  #dIct 형태로 dataframe 생성
    {"a" : [4,5,6,6,np.nan],
    "b" : [7,8,np.nan,9,9],
    "c" : [10,11,12,np.nan,12]}, 
    index = pd.MultiIndex.from_tuples(  #tuple로 지정
    [('d',1),('d',2),('e',2),('e',3),('e',4)],
    names = ['n','v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [79]:
df.head() #head는 5개까지 보여주지만, 원래 데이터가 5개이므로 tail값과 같다.

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [80]:
df.tail()

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [82]:
df.tail(2) #데이터가 100만개 넘어가면 head와 tail이 매우 유용하다.

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [83]:
df.head(2)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [84]:
df.sample(frac = 0.5) #frac은 특정 비율로 데이터를 sampling해온다. 1로 지정하면 모두 가져온다.

       a    b     c
n v
e 4  NaN  9.0  12.0
d 2  5.0  8.0  11.0

In [85]:
df.sample(n=10) #매개변수가 다르다. 기존 값(행 5개)보다 큰 값을 지정할 수 없다.

ValueError: Cannot take a larger sample than population when 'replace=False'

In [86]:
df.sample(n=5) #frac은 비율로, n은 개수로 sampling 하는 방법 선택하기

       a    b     c
n v
e 3  6.0  9.0   NaN
  2  6.0  NaN  12.0
d 1  4.0  7.0  10.0
e 4  NaN  9.0  12.0
d 2  5.0  8.0  11.0

In [87]:
df.iloc[10:20] #error는 없지만 범위가 없으므로 아무런 데이터를 불러오지 않는다.

Empty DataFrame
Columns: [a, b, c]
Index: []

In [89]:
df.iloc[1:2] #시작부터 끝나는 index

       a    b     c
n v
d 2  5.0  8.0  11.0

In [90]:
df.iloc[:2]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [91]:
df.iloc[3: ] #3부터 끝까지

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [93]:
df.iloc[-2: ] #마지막 뒤에서 2번째, iloc는 몇번째 행이냐만 구분해서 모두 가져온다. 주의할 것

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [95]:
df.nlargest?

In [96]:
df = pd.DataFrame({'population': [59000000, 65000000, 434000,
                                  434000, 434000, 337000, 11300,
                                  11300, 11300],
                   'GDP': [1937894, 2583560 , 12011, 4520, 12128,
                           17036, 182, 38, 311],
                   'alpha-2': ["IT", "FR", "MT", "MV", "BN",
                               "IS", "NR", "TV", "AI"]},
                  index=["Italy", "France", "Malta",
                         "Maldives", "Brunei", "Iceland",
                         "Nauru", "Tuvalu", "Anguilla"])
df

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [98]:
df.nlargest(1,'population') #population에서 가장 큰 값 불러온다.

        population      GDP alpha-2
France    65000000  2583560      FR

In [101]:
df.nsmallest(3,'population') #가장 작은 값 3개

          population  GDP alpha-2
Nauru          11300  182      NR
Tuvalu         11300   38      TV
Anguilla       11300  311      AI